"use client";
import "./ModalForm.scss";
import { useState } from "react";

export default function ModalForm() {
  const [status, setStatus] = useState("");

  const handleCall = () => {
    window.location.href = "tel:+7 (3842) 65 77 75";
  };

  const handleWhatsApp = () => {
    window.open(
      "https://api.whatsapp.com/send/?phone=79234808330&text=Здравствуйте%21+Пишу+с+сайта.+Хочу+обратиться+по+поводу&type=phone_number&app_absent=0",
      "_blank"
    );
  };

  const handleTelegram = () => {
    window.open("https://t.me/oblasovaleksandr", "_blank");
  };

  const handleVk = () => {
    window.open("https://vk.com/arhitek142", "_blank");
  };

  return (
    <>
      <div
        className="modal fade"
        id="exampleModal"
        tabIndex="-1"
        aria-labelledby="exampleModalLabel"
      >
        <div className="modal-dialog ">
          <div className="modal-content">
            <div className="modal-header">
              <h2 className="modal-title" id="exampleModalLabel">
                Мы не собираем и не передаем ваши персональные данные, поэтому
                свяжитесь с нами самостоятельно, пожалуйста
              </h2>
              <p className="modal-subtitle">Выберите удобный способ связи</p>
              <button
                type="button"
                className="btn-close"
                data-bs-dismiss="modal"
                aria-label="Close"
              ></button>
            </div>
            <div className="modal-body">
              <div className="contact-buttons">
                <button className="btn btn-call" onClick={handleCall}>
                  <div className="btn-icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      width="24"
                      height="24"
                      viewBox="0 0 24 24"
                      fill="none"
                      stroke="currentColor"
                      strokeWidth="2"
                      strokeLinecap="round"
                      strokeLinejoin="round"
                    >
                      <path d="M22 16.92v3a2 2 0 0 1-2.18 2 19.79 19.79 0 0 1-8.63-3.07 19.5 19.5 0 0 1-6-6 19.79 19.79 0 0 1-3.07-8.67A2 2 0 0 1 4.11 2h3a2 2 0 0 1 2 1.72 12.84 12.84 0 0 0 .7 2.81 2 2 0 0 1-.45 2.11L8.09 9.91a16 16 0 0 0 6 6l1.27-1.27a2 2 0 0 1 2.11-.45 12.84 12.84 0 0 0 2.81.7A2 2 0 0 1 22 16.92z"></path>
                    </svg>
                  </div>
                  <div className="btn-content">
                    <span className="btn-title">Позвонить</span>
                    <span className="btn-description">+7 (3842) 65 77 75</span>
                  </div>
                </button>

                <button className="btn btn-whatsapp" onClick={handleWhatsApp}>
                  <div className="btn-icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      x="0px"
                      y="0px"
                      width="100"
                      height="100"
                      viewBox="0 0 64 64"
                      fill="green"
                    >
                      <path d="M 32 10 C 19.85 10 10 19.85 10 32 C 10 36.065 11.10725 39.869719 13.03125 43.136719 L 10.214844 53.683594 L 21.277344 51.208984 C 24.450344 52.983984 28.106 54 32 54 C 44.15 54 54 44.15 54 32 C 54 19.85 44.15 10 32 10 z M 32 14 C 41.941 14 50 22.059 50 32 C 50 41.941 41.941 50 32 50 C 28.269 50 24.803687 48.864875 21.929688 46.921875 L 15.791016 48.294922 L 17.353516 42.439453 C 15.250516 39.493453 14 35.896 14 32 C 14 22.059 22.059 14 32 14 z M 24.472656 21.736328 C 24.105656 21.736328 23.515672 21.871969 23.013672 22.417969 C 22.520672 22.964969 21.113281 24.278844 21.113281 26.964844 C 21.113281 29.640844 23.057078 32.23675 23.330078 32.59375 C 23.603078 32.96075 27.100531 38.639266 32.644531 40.822266 C 37.240531 42.632266 38.179547 42.273688 39.185547 42.179688 C 40.183547 42.093688 42.408328 40.866703 42.861328 39.595703 C 43.313328 38.323703 43.312875 37.232906 43.171875 37.003906 C 43.034875 36.781906 42.676859 36.644094 42.130859 36.371094 C 41.584859 36.097094 38.906297 34.777656 38.404297 34.597656 C 37.909297 34.417656 37.542547 34.323141 37.185547 34.869141 C 36.818547 35.415141 35.778125 36.643953 35.453125 37.001953 C 35.138125 37.368953 34.823344 37.411672 34.277344 37.138672 C 33.731344 36.865672 31.975531 36.292594 29.894531 34.433594 C 28.275531 32.992594 27.182188 31.208063 26.867188 30.664062 C 26.551188 30.119062 26.832469 29.821828 27.105469 29.548828 C 27.353469 29.310828 27.652781 28.916563 27.925781 28.601562 C 28.189781 28.277563 28.282891 28.056453 28.462891 27.689453 C 28.651891 27.332453 28.555922 27.007375 28.419922 26.734375 C 28.284922 26.460375 27.226234 23.765406 26.740234 22.691406 C 26.332234 21.787406 25.905672 21.760953 25.513672 21.751953 C 25.196672 21.735953 24.829656 21.736328 24.472656 21.736328 z"></path>
                    </svg>
                  </div>
                  <div className="btn-content">
                    <span className="btn-title">WhatsApp</span>
                    <span className="btn-description">Написать в чат</span>
                  </div>
                </button>

                <button className="btn btn-telegram" onClick={handleTelegram}>
                  <div className="btn-icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      x="0px"
                      y="0px"
                      width="40"
                      height="40"
                      viewBox="0 0 64 64"
                      fill="#229ED9"
                    >
                      <path d="M 32 10 C 19.85 10 10 19.85 10 32 C 10 44.15 19.85 54 32 54 C 44.15 54 54 44.15 54 32 C 54 19.85 44.15 10 32 10 z M 32 14 C 41.941 14 50 22.059 50 32 C 50 41.941 41.941 50 32 50 C 22.059 50 14 41.941 14 32 C 14 22.059 22.059 14 32 14 z M 41.041016 23.337891 C 40.533078 23.279297 39.894891 23.418531 39.181641 23.675781 C 37.878641 24.145781 21.223719 31.217953 20.261719 31.626953 C 19.350719 32.014953 18.487328 32.437828 18.486328 33.048828 C 18.486328 33.478828 18.741312 33.721656 19.445312 33.972656 C 20.177313 34.234656 22.023281 34.79275 23.113281 35.09375 C 24.163281 35.38275 25.357344 35.130844 26.027344 34.714844 C 26.736344 34.273844 34.928625 28.7925 35.515625 28.3125 C 36.102625 27.8325 36.571797 28.448688 36.091797 28.929688 C 35.611797 29.410688 29.988094 34.865094 29.246094 35.621094 C 28.346094 36.539094 28.985844 37.490094 29.589844 37.871094 C 30.278844 38.306094 35.239328 41.632016 35.986328 42.166016 C 36.733328 42.700016 37.489594 42.941406 38.183594 42.941406 C 38.877594 42.941406 39.242891 42.026797 39.587891 40.966797 C 39.992891 39.725797 41.890047 27.352062 42.123047 24.914062 C 42.194047 24.175062 41.960906 23.683844 41.503906 23.464844 C 41.365656 23.398594 41.210328 23.357422 41.041016 23.337891 z"></path>
                    </svg>
                  </div>
                  <div className="btn-content">
                    <span className="btn-title">Telegram</span>
                    <span className="btn-description">Написать сообщение</span>
                  </div>
                </button>
                <button className="btn btn-telegram" onClick={handleVk}>
                  <div className="btn-icon">
                    <svg
                      xmlns="http://www.w3.org/2000/svg"
                      viewBox="0 0 64 64"
                      width="36px"
                      height="36px"
                      baseProfile="basic"
                      fill="#4d7198"
                    >
                      <path d="M41.242,35.833c2.088,1.854,2.522,2.515,2.593,2.628C44.7,39.833,42.876,40,42.876,40H39.03c0,0-0.936,0.01-1.736-0.52	c-1.304-0.854-2.669-2.51-3.63-2.222c-0.805,0.241-0.797,1.329-0.797,2.26c0,0.333-0.286,0.483-0.933,0.483h-1.202	c-2.107,0-4.392-0.709-6.672-3.092c-3.226-3.368-6.055-10.154-6.055-10.154s-0.167-0.342,0.015-0.55	c0.206-0.233,0.767-0.203,0.767-0.203L22.516,26c0,0,0.351,0.066,0.603,0.244c0.208,0.146,0.324,0.424,0.324,0.424	s0.626,2.068,1.424,3.387c1.559,2.574,2.284,2.639,2.813,2.362c0.773-0.401,0.521-3.138,0.521-3.138s0.035-1.175-0.369-1.699	c-0.311-0.405-0.905-0.621-1.165-0.654c-0.21-0.027,0.141-0.395,0.588-0.605c0.597-0.266,1.41-0.334,2.812-0.321	c1.091,0.01,1.406,0.076,1.831,0.174c1.287,0.297,0.969,1.08,0.969,3.829c0,0.881-0.121,2.12,0.543,2.53	c0.286,0.177,1.268,0.394,3.016-2.444c0.83-1.345,1.49-3.578,1.49-3.578s0.136-0.245,0.348-0.367	c0.216-0.124,0.21-0.121,0.507-0.121c0.297,0,3.273-0.023,3.926-0.023c0.652,0,1.265-0.007,1.37,0.375	c0.151,0.55-0.481,2.433-2.085,4.477C39.349,34.207,39.056,33.893,41.242,35.833z" />
                      <path d="M32,54c-12.131,0-22-9.869-22-22s9.869-22,22-22s22,9.869,22,22S44.131,54,32,54z M32,14	c-9.925,0-18,8.075-18,18s8.075,18,18,18s18-8.075,18-18S41.925,14,32,14z" />
                    </svg>
                  </div>
                  <div className="btn-content">
                    <span className="btn-title">Вконтакте</span>
                    <span className="btn-description">Написать сообщение</span>
                  </div>
                </button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
