export const priceData = [
  {
    title: "Эскизный проект",
    items: [
      { name: "Обмерный план помещений", price: "1 500 руб." },
      { name: "План монтажа/демонтажа перегородок.", price: "1 500 руб." },
      { name: "План расстановки мебели и оборудования.", price: "1 500 руб." },
      { name: "3D визуализация.", price: "1 500 руб." },
    ],
  },
  {
    title: "Дизайн-проект отделки",
    items: [
      { name: "Обмерный план помещений", price: "2 500 руб." },
      { name: "План монтажа/демонтажа перегородок.", price: "2 500 руб." },
      { name: "План расстановки мебели и оборудования.", price: "2 500 руб." },
      {
        name: "План размещения и схема открывания дверей.",
        price: "2 500 руб.",
      },
      { name: "Спецификация заполнения дверных проемов.", price: "2 500 руб." },
      {
        name: "План привязки сантехнических приборов. Спецификация оборудования.",
        price: "2 500 руб.",
      },
      {
        name: "План расстановки розеток и выключателей. Спецификация.",
        price: "2 500 руб.",
      },
      {
        name: "План размещения осветительных приборов. Спецификация осветительных приборов.",
        price: "2 500 руб.",
      },
      {
        name: "План плинтусов и напольных покрытий с раскладкой элементов. Ведомость финишных покрытий.",
        price: "2 500 руб.",
      },
      {
        name: "План потолков с отметками. Ведомость финишных покрытий.",
        price: "2 500 руб.",
      },
      {
        name: "План финишной отделки стен. Ведомость финишных покрытий.",
        price: "2 500 руб.",
      },
      {
        name: "Развертки стен.",
        price: "2 500 руб.",
      },
      { name: "3D визуализация.", price: "2 500 руб." },
    ],
  },
  {
    title: "Дизайн-проект отделки + авторский надзор",
    items: [
      { name: "Обмерный план помещений", price: "3 500 руб." },
      { name: "План монтажа/демонтажа перегородок.", price: "3 500 руб." },
      { name: "План расстановки мебели и оборудования.", price: "3 500 руб." },
      {
        name: "План размещения и схема открывания дверей.",
        price: "3 500 руб.",
      },
      { name: "Спецификация заполнения дверных проемов.", price: "3 500 руб." },
      {
        name: "План привязки сантехнических приборов. Спецификация оборудования.",
        price: "3 500 руб.",
      },
      {
        name: "План расстановки розеток и выключателей. Спецификация.",
        price: "3 500 руб.",
      },
      {
        name: "План размещения осветительных приборов. Спецификация осветительных приборов.",
        price: "3 500 руб.",
      },
      {
        name: "План плинтусов и напольных покрытий с раскладкой элементов. Ведомость финишных покрытий.",
        price: "3 500 руб.",
      },
      {
        name: "План потолков с отметками. Ведомость финишных покрытий.",
        price: "3 500 руб.",
      },
      {
        name: "План финишной отделки стен. Ведомость финишных покрытий.",
        price: "3 500 руб.",
      },
      {
        name: "Развертки стен.",
        price: "3 500 руб.",
      },
      { name: "3D визуализация.", price: "3 500 руб." },
      {
        name: "Комплектация объекта финишными отделочными материалами и мебелью.",
        price: "3 500 руб.",
      },
      { name: "Авторский надзор.", price: "3 500 руб." },
    ],
  },
];
