export const priceData = [
  {
    title: "Услуги",
    items: [
      { name: "Типовой проект (АС раздел)", price: "60 000 руб." },
      {
        name: "Индивидуальный проект жилого дома (АС раздел)",
        price: "200 000 руб.",
      },
      { name: "Водоснабжение и канализация", price: "60 000 руб." },
      { name: "Отопление", price: "60 000 руб." },
      { name: "Внутренние электрические сети", price: "60 000 руб." },
      {
        name: "Проект благоустройства",
        price: "Цена договорная",
      },
    ],
  },
  {
    title: "Раздел АИ (дизайн проект интерьера)",
    items: [{ name: "Базовый вариант", price: "от 2 500 руб." }],
  },
];
